nxp-mcuxpresso/mcux-sdk-examples/frdmmcxn236/multiprocessor_examples/erpc_server_matrix_multiply_i2c/pin_mux.h
/*
 * Copyright 2022-2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORT0_16 (coord B10), GPIO_BRIDGE
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_GPIO_BRIDGE_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_GPIO_BRIDGE_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_GPIO_BRIDGE_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT1_0 (coord C6), GPIO_HANDSHAKE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_GPIO_HANDSHAKE_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_GPIO_HANDSHAKE_GPIO_PIN 0U              /*!<@brief GPIO pin number */
#define BOARD_INITPINS_GPIO_HANDSHAKE_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_GPIO_HANDSHAKE_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_GPIO_HANDSHAKE_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_GPIO_HANDSHAKE_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
